IDEA Open Model
BeamDataEc2.BeamSpanLength Property
 beam span lengrh - theoretical support distance
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public double BeamSpanLength { get; set; }
Public Property BeamSpanLength As Double
	Get
	Set
public:
property double BeamSpanLength {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace